[M_RobotSlaughter_1 MissionDefinition]
MissionDescription="You've found Moxxi's final Circle of Slaughter. This circle, run by Innuendobot 5000 (a Hyperion loader reprogrammed by Moxxi to speak almost entirely in double entendres), will throw every manner of Hyperion enemy at you. If you can survive all five rounds, you'll earn a considerable reward."
MissionGiver="Innuendobot 5000"
MissionTurnInLocation="Innuendobot 5000"

[M_RobotSlaughter_1:SurviveRound MissionObjectiveDefinition]
ProgressMessage="Survive round one"

[M_RobotSlaughter_2 MissionDefinition]
MissionDescription="You've found Moxxi's final Circle of Slaughter. This circle, run by Innuendobot 5000 (a Hyperion loader reprogrammed by Moxxi to speak almost entirely in double entendres), will throw every manner of Hyperion enemy at you. If you can survive all five rounds, you'll earn a considerable reward."
MissionGiver="Innuendobot 5000"
MissionTurnInLocation="Innuendobot 5000"

[M_RobotSlaughter_2:SurviveRound MissionObjectiveDefinition]
ProgressMessage="Survive round two"

[M_RobotSlaughter_3 MissionDefinition]
MissionDescription="You've found Moxxi's final Circle of Slaughter. This circle, run by Innuendobot 5000 (a Hyperion loader reprogrammed by Moxxi to speak almost entirely in double entendres), will throw every manner of Hyperion enemy at you. If you can survive all five rounds, you'll earn a considerable reward."
MissionGiver="Innuendobot 5000"
MissionTurnInLocation="Innuendobot 5000"

[M_RobotSlaughter_3:SurviveRound MissionObjectiveDefinition]
ProgressMessage="Survive round three"

[M_RobotSlaughter_4 MissionDefinition]
MissionDescription="You've found Moxxi's final Circle of Slaughter. This circle, run by Innuendobot 5000 (a Hyperion loader reprogrammed by Moxxi to speak almost entirely in double entendres), will throw every manner of Hyperion enemy at you. If you can survive all five rounds, you'll earn a considerable reward."
MissionGiver="Innuendobot 5000"
MissionTurnInLocation="Innuendobot 5000"

[M_RobotSlaughter_4:SurviveRound MissionObjectiveDefinition]
ProgressMessage="Survive round four"

[M_RobotSlaughter_5 MissionDefinition]
MissionDescription="You've found Moxxi's final Circle of Slaughter. This circle, run by Innuendobot 5000 (a Hyperion loader reprogrammed by Moxxi to speak almost entirely in double entendres), will throw every manner of Hyperion enemy at you. If you can survive all five rounds, you'll earn a considerable reward."
TurnInDescription="You've completed the Hyperion Slaughter! Mechanized warriors everywhere will speak of you in hushed whispers -- or they would, if robots were capable of whispering. Or emotion."
MissionGiver="Innuendobot 5000"
MissionTurnInLocation="Innuendobot 5000"
